#include <iostream> //подключение библиотек//
#include <cmath> //подключение библиотек//

int main()
{
	setlocale(LC_ALL, "RUS"); //устанавливаем локаль//
	using namespace std; //использование прространства имен//
	float a = 0, b = 3, n = 200, h, s = 0, x = 0, func = 0, func1 = 0, s1, s2, i, funca, funcb, funca_h;//переменные//
	h = (b - a) / (2 * n); //промежуток//
	x = a + 2 * h;
	s1 = 0; s2 = 0;
	i = 1;
	for (i=1; i <=n; i++) //используем метод параболы
	{
		func = pow(x, 3) - 1; //значение функции f(x)//
		func1 = pow((x + h), 3) - 1; //значение функции f(x+h)//
		s2 = func + s2; //вычисляем площадь трапеции//
		x = x + h;
		s1 = s1 + func1; //вычисляем площадь трапеции//
		x = x + h;
	}
	funca = pow(a, 3) - 1; //значение функции f(a)//
	funca_h = pow((a + h), 3) - 1; //значение функции f(a+h)//
	funcb = pow(b, 3) - 1; //значение функции f(b)//
	s = h / 3 * (funca + 4 * funca_h + 4 * s1 + 2 * s2 + funcb);//Вычисление значения площади криволинейной трапеции//
	cout << "Метод параболы: " << s << endl;
}